docs: update architecture and flow by mermaid
